package com.joonggo.pro.login.service;

import javax.servlet.http.HttpSession;

import com.joonggo.pro.login.dto.LoginDTO;
import com.joonggo.pro.login.dto.UserDTO;




public interface LoginService {

	//-------------------------------------------------------------------------------------------------
	// 로그인
	//-------------------------------------------------------------------------------------------------
	public UserDTO login(UserDTO userDTO) throws Exception;
	
	//-------------------------------------------------------------------------------------------------
	// 로그인 검사
	//-------------------------------------------------------------------------------------------------
	public String loginCheck(UserDTO userDTO, HttpSession session) throws Exception;

	//-------------------------------------------------------------------------------------------------
	//로그아웃 => 세션 초기화
	//-------------------------------------------------------------------------------------------------
	public void logout(HttpSession session) throws Exception;

	//-------------------------------------------------------------------------------------------------
	// 아이디 찾기
	//-------------------------------------------------------------------------------------------------
	public UserDTO findId(UserDTO userDTO) throws Exception;
	
	
	//-------------------------------------------------------------------------------------------------
	// 비밀번호 찾기
	//-------------------------------------------------------------------------------------------------
	public UserDTO findPw(UserDTO userDTO) throws Exception;

}
